name = input('Введите имя человека:')

if name == 'Елена':
    print('Имя:Елена')
    print('Дата Рождения:20.09.1977')
    print('Место рождения и проживания:Балашиха,Мытищи')
    print('Дети:любимый сынуля и МЕГА ДОЧЬ')
    print('Муж:Мосин Александр Николаевич')

elif name == 'Наталья':
    print('Имя:Наталья')
    print('Место рождения:Москва/Мытищи')
    print('Возраст:17')
    print('Родители:Мама,Папа|Брат/сестра:мега бразэ')
    print('Чтобы узнать больше,спросите у нее....☺☺')

elif name == 'Александр':
    print('Имя:Александр/Саша')
    print('Место рождения/проживание:Кострома/Мытищи/Grasten')
    print('Дети:МЕГА СЫН И МЕГА ДОЧЬ')
    print('Прикоист,надо дать саечек')

elif name == 'Дарина':
    print('ФИО:Князева Дарина(отчество неизвестно)')
    print('Место проживания:Мытищи')
    print('Возраст:13 годиков')
    print('Место обучения:МБОУ МЛГ №33 к2')
    print('Рост:на голову ниже создателя программы')
    print('Крутая,стесняется,красивая')

elif name == 'Андрей♥':
    print('ФИО:Москворецкий Андрей Евгеньевич')
    print('Место проживания:Мытищи')
    print('По совместительству лучший братишь')
    print('Место обученя:шк 33 к2 7м(и)')
    print('Вораст:13 кондиций с тетрадкой физики')
    print('Лучший рапик♥')

elif name == "Микробро♥":
    print('Имя:Максим(сокращенно микро брошка)')
    print('Место обучения:№33 к1')
    print('Рост/Возраст:Пупс♥,11лет')
    print('Место проживания:Мытищи')
    print('Очень крутой чел ваще ♥')

elif name == 'Богдан♥':
    print('Имя:Богдан')
    print('Место обучения:№33 к1')
    print('Возраст:11')
    print('Место проживания:Мытищи')
    print('ну крутой ваще')

elif name == 'Миша':
    print('Имя:Миша')
    print('Место проживания:Мытищи')
    print('Хобби:гитара')
    print('Player 2')
    print('Крутой,весь в веснушках')

elif name == 'Артемий':
    print('Артемий')
    print('По совместительству Артем/Артем4ик и просто хорош')
    print('Место проживая:Мытищи')
    print('Тоже занимается програмированием')
    print('Возраст:13 сиговинок')
    print('Бравле старсИр♥')

elif name == 'Вероника':
    print('Имя:Вероника/Ника')
    print('Место проживания:г.Мытищи')
    print('Возраст:14 тг премов')
    print('100% не грустила')
    print('крутая,веселая♥')

elif name == 'Софа':
    print('Имя:Софа/Сова/мега диванище')
    print('Место проживания:Мытищи')
    print('Любит гулять(создатель программы так понял)')
    print('Возраст:14')
    print('место обучения:№33 к1 в классе с Вероникой')
    print('Крутая,с красными прядями')
else:
    print('Введите корректно имя . . .')

